Revit 2027 API
AdvancedOpaque.SurfaceCutout Property
 The property labeled "Image" from the "AdvancedOpaque" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SurfaceCutout { get; }
Public Shared ReadOnly Property SurfaceCutout As String
	Get
public:
static property String^ SurfaceCutout {
	String^ get ();
}
static member SurfaceCutout : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
AdvancedOpaque Class
Autodesk.Revit.DB.Visual Namespace